{
  "name":"Quang Nguyen",
  "headerTaglineOne":"Hello 👋",
  "headerTaglineTwo":"I'm Quang Nguyen - Fullstack Developer",
  "headerTaglineThree":"Web developer",
  "headerTaglineFour":" based in Da Nang, Viet Nam.",
  "showCursor":true,
  "showBlog":true,
  "darkMode":true,
  "showResume":true,
  "socials":[
    {"id":"1","title":"Github","link":"https://github.com/nguyenhdangquang"},
    {"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/quang-nguyen-827b51169/"},
    {"id":"3","title":"Facebook","link":"https://www.facebook.com/dore.kudo/"},
    {"id":"4","title":"Upwork","link":"https://www.upwork.com/freelancers/~01399ca63a9332e592"},
    {"id":"5","title":"Email","link":"mailto:nguyenhdangquang@gmail.com"}
  ],
  "projects":[
    {"id":"1","title":"Advance One Quote","description":"Provide recommendations price for users who want to book the contract with Ocean Network Express logistic Company, conducting market research on 100k+ Port Pairs.","imageSrc":"../images/advance-one-quote.png","url":"https://ecomm.one-line.com/one-ecom/prices/one-quote"},
    {"id":"2","title":"Ember Fitness","description":"In 2 years, successfully delivered Ember Fitness which the web service provides the environment for coaching to connect with gym goers, serving 10k+ users including coaches and gym goers. Helping coaches storage their coach and editing based on their way and notify that feature for gym goers also.","imageSrc":"../images/ember-fitness.png","url":"https://www.instagram.com/emberfitnessapp/"},
    {"id":"3","title":"Perfume store","description":"Provide web application that help sales bring their product to client closer also support payment on our platform.","imageSrc":"../images/perfume-store.png","url":"https://perfume-ecommerce-nextjs-13-tailwind.vercel.app/"},
    {"id":"4","title":"Restaurant Suggestion App","description":"Build web application that suggest the restaurant based on location which their want to go, or closest.","imageSrc":"../images/restaurant-app.png","url":"https://nextjs-prisma-trpc-postgresql-restaurant.vercel.app/"},
    {"id":"5","title":"Ecommerce Payment","description":"Be a part of the team who is conducting the payment gateway services which connect HSBC bank in 1 year.","imageSrc":"../images/e-payment.png","url":"https://www.youtube.com/watch?v=o0mQSEWmoYU"},
    {"id":"6","title":"E-Calendar","description":"Build the E-Calendar services from scratch integrate with Google Calendar API to help the HR department sync up their booked schedule with candidates and also notification on mobile in 4 months.","imageSrc":"../images/google-calendar.png","url":"#"},
    {"id":"7","title":"Digital Marketing","description":"Build up system combines ideal CRM & Digital Marketing platforms including to serve 10+ teams working with sales teams to identify campaigns and helping manage coupon services which target users.","imageSrc":"../images/digital-marketing.png","url":"#"},
    {"id":"8","title":"Real Estate Logistics","description":"Evaluated 100+ real estate in the US, also helping connect 500+ users able to put the notification for estate which they want to sell with who really needed it in 6 months.","imageSrc":"../images/real-estate.png","url":"#"},
    {"id":"9","title":"Veritas Strong","description":"In 4 months delivered this web service helping doctors create the patient regimens for treatment, as well as allow patients book doctors for carrying them, provide for users some common guiding treatment through their own premade course exercise. After going live we had gained 300 users.","imageSrc":"../images/veratis-strong.png","url":"#"}
  ],
  "highlights":[
    {"id":"1","title":"Web developer","description":"Integration APIs, Implement user interface, setup CI/CD, Contribute to documentation, Design and Implement APIs, Manage database Operations (schemas, queries), contribute deployment process with deploy docker image with EC2, storage manage by S3, Integration Third-party CAPTCHA, Integrate Cloud Function with GCP Provider - GCP Bucket, GCP Pub/Sub, GCP Schedules"},
    {"id":"2","title":"Business Consultant","description":"Work closely with our clients and internal teams to identify business challenges and provide strategic solutions. You will help shape business models, optimize processes, and align technology solutions with our clients’ goals. Leveraging your experience in the development industry, you’ll bridge the gap between technical and business needs, offering guidance on both sides."},
    {"id":"3","title":"Leadership","description":"Coaching - Internship Program at One Tech Stop VN, Leader of the team join hackathon GO GREEN! Coaching and finish in 3rd place"},
    {"id":"4","title":"Cert","description":"Google Cloud Skill Boost - Cloud Engineering Learning Path, Fundamental of Computing, Object Oriented Programming - C++ (OOP)"}
  ],
  "aboutpara":"Play role Fullstack developer, I have developed a deep understanding of both front-end and back-end technologies, delivering efficient and scalable solutions. My passion for coding, coupled with my ability to work in diverse environments, has equipped me to contribute effectively to your team. Throughout my career, I have honed my skills in a variety of programming languages, including JavaScript, Python, and PHP, and worked extensively with frameworks like React, Node.js.  I have led several projects from inception to completion, collaborating closely with cross-functional teams to create applications that meet business needs while ensuring an exceptional user experience. Leading a team of junior developers, mentoring them in best practices and modern development methodologies.",
  "resume":{
    "tagline":"👋  I'm a software engineer, product designer.",
    "description":"Play role Fullstack developer, I have developed a deep understanding of both front-end and back-end technologies, delivering efficient and scalable solutions. My passion for coding, coupled with my ability to work in diverse environments, has equipped me to contribute effectively to your team. Throughout my career, I have honed my skills in a variety of programming languages, including JavaScript, Python, and PHP, and worked extensively with frameworks like React, Node.js.  I have led several projects from inception to completion, collaborating closely with cross-functional teams to create applications that meet business needs while ensuring an exceptional user experience. Leading a team of junior developers, mentoring them in best practices and modern development methodologies.",
    "experiences":[
      {"id":"1","dates":"June 2022 - Present","type":"Onsite - One Tech Stop Viet Nam","position":"Sr. Fullstack Develop","bullets":"Be a part of the team who is conducting the payment gateway services which connect HSBC bank in 1 year., Provide recommendations price for users who want to book the contract with Ocean Network Express logistic Company conducting market research on 100k+ Port Pairs., Build up system combines ideal CRM & Digital Marketing platforms including to serve 10+ teams working with sales teams to identify campaigns and helping manage coupon services which target users., Build the E-Calendar services from scratch integrate with Google Calendar API to help the HR department sync up their booked schedule with candidates and also notification on mobile in 4 months., Third-ranked team OTSV Hackathon GO GREEN!"},
      {"id":"2","dates":"Jan 2019 - June 2021","type":"Remote - US EmberFitness","position":"Md. Fullstack Developer","bullets":"In 2 years successfully delivered Ember Fitness which the web service provides the environment for coaching to connect with gym goers, Serving 10k+ users including coaches and gym goers. Helping coaches storage their coach and editing based on their way and notify that feature for gym goers also., Integrate Google locate with visually the map box combined with GPS to provide driver get driving direction, Live traffic map and road alert. Helping 1k+ drivers sharing their experiences when they are on the road and going live after 1 year., Evaluated 100+ real estate in the US also helping connect 500+ users able to put the notification for estate which they want to sell with who really needed it in 6 months., In 4 months delivered this web service helping doctors create the patient regimens for treatment as well as allow patients book doctors for carrying them, Provide for users some common guiding treatment through their own premade course exercise. After going live we had gained 300 users."},
      {"id":"3","dates":"April 2017 – Dec 2018","type":"Onsite - SmartDev LLC","position":"Jr. Fullstack Developer","bullets":"Collect price of goods which users want to search for - also provide some patterns to help users collect prices with competitors by themselves., Crawling data from BBC website which collect information related to dishes., Build mobile application builds up the community through the app and recommendations for breast cancer patients with another one having the same situation."}
    ],
    "education":{
      "universityName":"Duy Tan University - Linked CMU (Carnegie Mellon University)",
      "universityDate":"2014-2018",
      "universityPara":"Software Engineering (GPA: 3.48). Cert: Fundamental of Computing - Object Oriented Programming - C++ (OOPC)"
    },
    "languages":["Javascript","HTML5","CSS","Go","PHP", "Python"],
    "frameworks":["NodeJs", "React","Typescript", "Loopback", "Strapi", "Nextjs", "Nestjs", "Adonis", "ExpressJs"],
    "databases":["MongoDB", "PostgreSQL","MariaDB", "DynamoDB", "Oracle"],
    "others":["Figma","AWS", "GCP", "Docker", "K8s", "Kafka", "Redis", "Github Actions", "Bitbucket Pipeline"]
    }
  }
